import { IProduct } from "../types";

export const DEFAULT_USER_IMAGE = "https://cdn.pixabay.com/photo/2015/10/05/22/37/blank-profile-picture-973460__340.png"

export const MOCK_PRODUCTS_LIST: IProduct [] = [
  {
    name: "Спортивний костюм Puma Baseball Tricot Suit 58584306 3XL Peacoat",
    imageURL: "https://content2.rozetka.com.ua/goods/images/big/254622942.jpg",
    description: `
    Спортивний костюм PUMA Baseball Tricot складається з толстовки і довгих штанів.


    Характеристики толстовки:
    
    
    
    Ребристий бейсбольний комір
    
    Повна блискавка
    
    Кишені з переднім швом для зручного зберігання
    
    Еластичні манжети та пояс
    
    Звичайна посадка
    
    
    Характеристики штанів:
    
    
    
    Еластичний пояс із внутрішніми зав'язками для додаткового комфорту
    
    Бічні кишені
    
    Еластичні манжети
    
    Звичайна посадка
    `,
    reviews:  [
      {
        userName: "Віталій Войчишин",
        text: `Розмірна сітка взята від балди!!!,(для працівників-які її сюди ставили,зайдіть на офіційний сайт і подивіться,яка вона має бути,тим більше,що сітка там є індивідуальна під цей костюм!!!) Прийшлось повернути товар,чекаю на рішення!!!`,
        score: 3.8,
        date: "12 April 2022"
      },      
    ],
    price: 2890,
    actualPrice: 1990,
    isAvailable: true 
  },
  {
    name: "Спортивний костюм Puma Loungewear Suit 84585536 XL Lotus",
    imageURL: "https://content.rozetka.com.ua/goods/images/big/199140058.jpg",
    description: "Puma — це не просто марка спортивного взуття й одягу з Німеччини. Це унікальний бренд, який майже 70 років допомагає світовим спортсменам ставати чемпіонами. Це ім'я, яке знає кожен мешканець Землі, цінує комфорт, довговічність та індивідуальність в одязі та взутті.",
    reviews:  [
      {
        userName: "Дзюба Владимир",
        text: `Костюм очень хороший.
        И цвет и качество и модель.
        Но большемерит.`,
        score: 4.8,
        date: "12 April 2022"
      },      
    ],
    price: 3100,
    actualPrice: 1999,
    isAvailable: true 
  },{
    name: "Спортивний костюм Puma Loungewear Suit 67002547 XS Rose Quartz",
    imageURL: "https://content1.rozetka.com.ua/goods/images/big/288767385.jpg",
    description: `
    Навіщо погоджуватися на менше, ніж максимальний комфорт? Зі спортивним костюмом Puma Loungewear Suit в цьому точно немає необхідності.

Простора, невимушена посадка дає вам повну свободу рухів. Затишна ребриста окантовка додає комфорту.

Модель виконана із надм'якої спортивної тканини з високим вмістом бавовни.

Деталі:

Вільна посадка;
Круглий виріз у рубчик; li>
Ребристі манжети на рукавах;
Приталений пояс з внутрішнім шнурком на штанях;
Бічні кишені на штанах;
Ребристі манжети на штанах;
Контур логотипу PUMA Cat на грудях;
Контур логотипу PUMA Cat на лівій нозі.`,
    reviews:  [
      {
        userName: "Анна",
        text: "Дуже сподобалась тканина, на дотик м'яка та приємна. З середини утеплений. Взяла свій розмір, нормально сів. Штани трохи заширокі, такі собі шаровари, але разом з кофтою виглядає органічно. Здивувалась, що по довжині штани нормальні, маю зріст 158 і часто доводилось вкорочувати. Кофта коротка, точно як на фото. Загалом задоволена, класна річ.",
        score: 4.8,
        date: "12 April 2022"
      },      
    ],
    price: 3100,
    actualPrice: 1799,
    isAvailable: true 
  },{
    name: "Спортивні штани Joma Cleo II 101334.100 S Чорні",
    imageURL: "https://content2.rozetka.com.ua/goods/images/big/269912075.jpg",
    description: "Спортивні штани Joma CLEO II чудово підходять для тренувань. Штани Joma виготовлені з високотехнологічного поліестеру, що дає змогу шкірі дихати та виводить зайву вологу назовні, дає змогу почуватися максимально комфортно.",
    reviews:  [
      {
        userName: "Павло Буйний",
        text: "Хорошая модель, есть утеплитель. Сели хорошо",
        score: 3.8,
        date: "12 April 2022"
      },      
    ],
    price: 1250,
    actualPrice: 790,
    isAvailable: true 
  },
  {
    name: "Чоловічі кросівки New Balance 574 ML574EVB 41.5 (9) 27 см Чорні із сірим",
    imageURL: "https://content1.rozetka.com.ua/goods/images/big/310286816.jpg",
    description: `574 – одна з найпопулярніших моделей New Balance, що поєднує у собі високий комфорт та якість. Завдяки впізнаваному силуету та базовим кольорам ця модель стає незамінною для тих, хто шукає зручність на кожен день. Технологія Encap сприяє легкій амортизації та стабілізації стопи, забезпечуючи неперевершений комфорт протягом усього дня.

    Рекомендації щодо догляду:
    
    Після кожної носки просушувати взуття уникаючи нагрівання. Використовувати вологозахисний спрей. Рекомендується хімчистка, якщо виробник не вказав інший спосіб чищення на виробі чи упаковці. Уникати сильного намокання під час носіння. Зберігати взуття, використовуючи спеціальні вставки або папір для підтримки форми.`,
    reviews:  [
      {
        userName: "Артем Є.А.",
        text: "З розміром все зійшлось, трохи заширокі як на мене в підйомі, тому треба сильніше зашнуровувати, щоб нога не ковзала, але це індивідуально. Носив всього декілька разів, тому поки мало що можна сказати.",
        score: 5,
        date: "2 April 2022"
      },      
    ],
    price: 4199,
    actualPrice: 2699,
    isAvailable: true 
  },{
    name: "Чоловічі кросівки New Balance Shando MTSHALK 42 (8.5) 26.5 см Сірі з чорним",
    imageURL: "https://content1.rozetka.com.ua/goods/images/big/311522075.jpg",
    description: "Тестовий опис, lorem ipsum doler sit amet. ",
    reviews:  [
      {
        userName: "Павло Буйний",
        text:`
        Якщо ви шукаєте комфортні кроси на прохолодну пору, оминайте цей шлак. Шкодую витрачених грошів і часу. В 7 верхня частина продувається, як марлеві труси, хоча взуття ніби демісізонне. В дощ взагалі не виходьте з дому в них, бо води буде в кросах стільки ж, як і в калюжах. Підошва наче й пружня, але некомфортна, щось на рівні гуми з китайських сандаль, добігти в них можна, і варто, лише до інших кросів. Тренуватися в цьому взагалі не в кайф.
Єдине, що варте уваги - якість пошиву, і, можливо, матеріалів. Тільки за це 2га зірка.
`,
        score: 1.8,
        date: "12 April 2022"
      },      
    ],
    price: 4599,
    actualPrice: 2799,
    isAvailable: true 
  },{
    name: "Чоловічі кросівки New Balance 574 U574TX2 44 (10) 28 см Чорний/Зелені",
    imageURL: "https://content1.rozetka.com.ua/goods/images/big/310287127.jpg",
    description: `
    Кросівки для міста від New Balance — одна з найпопулярніших моделей. Вони поєднують у собі високий комфорт та якість. Завдяки впізнаваному силуету та базовим кольорам ця модель стає незамінною для тих, хто шукає зручність на кожен день. Кросівки підходять для тривалих прогулянок та активних міських буднів.

Особливості:

Верх із натуральної замші та текстилю.
Легка проміжна підошва з EVA з гарною міцністю та гнучкістю.
Технологія ENCAP допомагає знизити навантаження на ноги та поглинає удари під час ходьби.
Стабілізуюча вставка в зоні п'яти для додаткової амортизації.
Текстильне шнурування для надійної фіксації.
Фірмовий декор New Balance.
Рекомендації щодо догляду:

Після кожної шкарпетки просушувати взуття, уникаючи нагрівання.
Використовувати вологозахисний спрей.
Рекомендується хімчистка, якщо виробник не вказав інший спосіб чищення на виробі або упакуванні.
Уникати сильного намокання під час носіння.
Зберігати взуття, використовуючи спеціальні вставки або папір для підтримки форми.
`,
    reviews:  [
      {
        userName: "Артем Шпилевський",
        text: `Дуже багато видно клею між подошвою та самим верхом. Пошиті начебто добре. Але в них не має такої вентиляції як в звичайних моделях, так як зверху не сітка а кордура. Носок прорезинений, що мабудь не погано.`,
        score: 4.8,
        date: "12 April 2022"
      },      
    ],
    price: 2890,
    actualPrice: 1990,
    isAvailable: true 
  }
]